import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  title: "柒柒酱的个人小站",
  description: "柒柒酱的个人小站",
  head: [["link", { rel: "icon", href: "/icon.svg" }]],
  themeConfig: {
    search: {
      provider: "local",
      options: {
        translations: {
          button: {
            buttonText: "搜索文档",
            buttonAriaLabel: "搜索文档",
          },
          modal: {
            noResultsText: "无法找到相关结果",
            resetButtonTitle: "清除查询条件",
            footer: {
              selectText: "选择",
              navigateText: "切换",
            },
          },
        },
      },
    },
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: '主页', link: '/' },
      { text: '社会现象与心理', link: '/社会现象与心理/Social_Phenomenon&Psycholgy' },
      { text: '自我提升和学习', link: '/自我提升和学习/Self_improvement&Studying' },
      { text: '社交与信息获取', link: '/社交与信息获取/Socializing&Information_Gathering' },
      { text: '其他随笔', link: '/其他随笔/Others' },
    ],
    
    sidebar: [
      {
        text: '自我提升和学习',
        items: [
          { text: 'Think Carefully & Move Boldly：柒柒的高二总结', link: '/自我提升和学习/Think Carefully & Move Boldly：柒柒的高二总结' },
          { text: '周记25.16-主观能动性，金钱观，博弈下的人际关系', link: '/自我提升和学习/周记25.16-主观能动性，金钱观，博弈下的人际关系' },
          { text: '周记25.17-回首与重构：对过往学习方式的重新审视', link: '/自我提升和学习/周记25.17-回首与重构：对过往学习方式的重新审视' },
          { text: '周记25.20-自信的培养与主被动学习的同调', link: '/自我提升和学习/周记25.20-自信的培养与主被动学习的同调' },
          { text: '周记25.22-专注力&日程规划的方法与感悟', link: '/自我提升和学习/周记25.22-专注力&日程规划的方法与感悟' },
          { text: '阶段二结束后的思考-20241224', link: '/自我提升和学习/阶段二结束后的思考（2024年12月24日）' },
          { text: '早点关注自己的未来，很有好处-20250327', link: '/自我提升和学习/早点关注自己的未来，很有好处（2025年3月27日）' },
          
        ]
      },
    
      {
        text: "社交与信息获取",
        items: [
          { text: 'Friend is Magic：我是怎么离开社交深渊的', link: '/社交与信息获取/Friend is Magic：我是怎么离开社交深渊的' },
          { text: '社交笔记之一：将抑郁深藏于心的“小太阳”', link: '/社交与信息获取/社交笔记之一：将抑郁深藏于心的“小太阳”' },
          { text: '社交笔记之二：中考复读，她如何“出淤泥而不染”', link: '/社交与信息获取/社交笔记之二：中考复读，她如何“出淤泥而不染”' },
          { text: '社交记录之三：何时淡出一段关系；二次元社交', link: '/社交与信息获取/社交记录之三：何时淡出一段关系；二次元社交' },
        ]
      },
    
      {
        text: "社会现象与心理",
        items: [
          { text: '多意识体相关：plurality_1107_research', link: '/社会现象与心理/多意识体相关：plurality_1107_research' },
          { text: '亚硝酸钠与自杀干预', link: '/社会现象与心理/亚硝酸钠与自杀干预' },
          { text: '关于od的研究笔记：一切分崩离析之后', link: '/社会现象与心理/关于od的研究笔记：一切分崩离析之后' },
          
          {
            text: "药物滥用白皮书",
            items: [
              { text: '前言+第一章：界定难题＆现象总览', link: '/社会现象与心理/药物滥用白皮书/前言+第一章：界定难题＆现象总览' },
              { text: '第二章：应试，家庭，社会加剧精神危机', link: '/社会现象与心理/药物滥用白皮书/第二章：应试，家庭，社会加剧精神危机' },
              { text: '第三章：从药理上区分od和毒品，心理类和趋乐类', link: '/社会现象与心理/药物滥用白皮书/第三章：从药理上区分od和毒品，心理类和趋乐类' },
              { text: '第四章：药滥现象的扩散与其引发的问题', link: '/社会现象与心理/药物滥用白皮书/第四章：药滥现象的扩散与其引发的问题' },
              { text: '第五章+第六章：理解包容为何难以落实；上位式的科普和措施问题所在', link: '/社会现象与心理/药物滥用白皮书/第五章+第六章：理解包容为何难以落实；上位式的科普和措施问题所在' },
              { text: '附录：个人案例&调查统计', link: '/社会现象与心理/药物滥用白皮书/附录：个人案例&调查统计' },
            ]
          },
          
          {
            text: "VRChat与社交",
            items: [
              { text: 'VRC与虚拟社交', link: '/社会现象与心理/VRChat与社交/VRC与虚拟社交' },
              { text: '情感砂糖与泛泛之交：VRChat如何折射我们的社交旅途', link: '/社会现象与心理/VRChat与社交/情感砂糖与泛泛之交：VRChat如何折射我们的社交旅途  与一切社交的吸引力法则' },
              { text: '如何评价游戏VRChat？', link: '/社会现象与心理/VRChat与社交/如何评价游戏VRChat？' },
            ]
          },
          
          {
            text: "校园教育的批判",
            items: [
              { text: '应试教育：为何离开，何时回来', link: '/社会现象与心理/校园教育的批判/应试教育：为何离开，何时回来' },
              { text: 'AI和算法时代之下：脑测应试教育的未来', link: '/社会现象与心理/校园教育的批判/AI和算法时代之下：脑测应试教育的未来' },
              { text: '学校批判存档-20250620', link: '/社会现象与心理/校园教育的批判/20250620 学校批判存档' },
            ]
          }
        ]
      },
    
      {
        text: "其他随笔",
        items: [
          { text: '荐号荐号', link: '/其他随笔/荐号荐号' },
          { text: '微调AI的数字分身＆长篇社会报告写作的感悟', link: '/其他随笔/[科技]微调AI的数字分身＆长篇社会报告写作的感悟' },
          { text: '互联网普及那么多年，谁还记得真正有益的上网原则', link: '/其他随笔/[科技]互联网普及那么多年，谁还记得真正有益的上网原则' },
          { text: '内容创作的两项根本矛盾', link: '/其他随笔/内容创作的两项根本矛盾' },
          { text: '心理咨询室背后的窗户-小短文', link: '/其他随笔/心理咨询室背后的窗户-小短文' },
          { text: '游戏的吸引力和四象限分类法', link: '/其他随笔/游戏的吸引力和四象限分类法' },
          { text: '金钱与欲望，价值与虚无', link: '/其他随笔/金钱与欲望，价值与虚无' },
        ]
      },

      {
        text: "Project",
        items: [
          {text: '旧版博客（内含已归档文章）',link:"https://seroliya.github.io/-archived-Seroliya.github.io/"}
        ]
      }
    ],

    socialLinks: [
      { icon: 'x', link: 'https://x.com/77KawaiiQwQ' },
      
      {
      icon: {svg: '<svg t="1676025513460" class="icon" viewBox="0 0 1129 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2745" width="200" height="200"><path d="M234.909 9.656a80.468 80.468 0 0 1 68.398 0 167.374 167.374 0 0 1 41.843 30.578l160.937 140.82h115.07l160.936-140.82a168.983 168.983 0 0 1 41.843-30.578A80.468 80.468 0 0 1 930.96 76.445a80.468 80.468 0 0 1-17.703 53.914 449.818 449.818 0 0 1-35.406 32.187 232.553 232.553 0 0 1-22.531 18.508h100.585a170.593 170.593 0 0 1 118.289 53.109 171.397 171.397 0 0 1 53.914 118.288v462.693a325.897 325.897 0 0 1-4.024 70.007 178.64 178.64 0 0 1-80.468 112.656 173.007 173.007 0 0 1-92.539 25.75h-738.7a341.186 341.186 0 0 1-72.421-4.024A177.835 177.835 0 0 1 28.91 939.065a172.202 172.202 0 0 1-27.36-92.539V388.662a360.498 360.498 0 0 1 0-66.789A177.03 177.03 0 0 1 162.487 178.64h105.414c-16.899-12.07-31.383-26.555-46.672-39.43a80.468 80.468 0 0 1-25.75-65.984 80.468 80.468 0 0 1 39.43-63.57M216.4 321.873a80.468 80.468 0 0 0-63.57 57.937 108.632 108.632 0 0 0 0 30.578v380.615a80.468 80.468 0 0 0 55.523 80.469 106.218 106.218 0 0 0 34.601 5.632h654.208a80.468 80.468 0 0 0 76.444-47.476 112.656 112.656 0 0 0 8.047-53.109v-354.06a135.187 135.187 0 0 0 0-38.625 80.468 80.468 0 0 0-52.304-54.719 129.554 129.554 0 0 0-49.89-7.242H254.22a268.764 268.764 0 0 0-37.82 0z m0 0" fill="#20B0E3" p-id="2746"></path><path d="M348.369 447.404a80.468 80.468 0 0 1 55.523 18.507 80.468 80.468 0 0 1 28.164 59.547v80.468a80.468 80.468 0 0 1-16.094 51.5 80.468 80.468 0 0 1-131.968-9.656 104.609 104.609 0 0 1-10.46-54.719v-80.468a80.468 80.468 0 0 1 70.007-67.593z m416.02 0a80.468 80.468 0 0 1 86.102 75.64v80.468a94.148 94.148 0 0 1-12.07 53.11 80.468 80.468 0 0 1-132.773 0 95.757 95.757 0 0 1-12.875-57.133V519.02a80.468 80.468 0 0 1 70.007-70.812z m0 0" fill="#20B0E3" p-id="2747"></path></svg>',},
      link: "https://space.bilibili.com/1501387815",
      }
    ]
  }
})
